projects/volunteer/master/app/controllers/login_controller.rb

SELECT * FROM `users` WHERE (`users`.`id` = 1)
SELECT * FROM `users` WHERE (`users`.`email` = 'lj') LIMIT 1
---
  def index
    if session[:user_id]
      @user = User.find(session[:user_id])
    end

    if request.post?
      @user = User.find_by_email(params[:email])

SELECT * FROM `users` WHERE (`users`.`id` = 1)
---
  def secret
    if session[:user_id] && @user = User.find(session[:user_id])