projects/volunteer/master/app/controllers/organizations_controller.rb

SELECT * FROM `organizations` LIMIT 1
---
  def index
    @orgs = Organization.find :all

SELECT * FROM `users` WHERE (`users`.`id` = 1)
INSERT INTO `organizations` (`address`, `city`, `country`, `prov_st`, `email`) VALUES('1164 park ridge', 'oshawa', 'canada', 'ontario', 'adamw@tbcn.ca')
---
  def create
    if session[:user_id] && @user = User.find(session[:user_id])
      @org = Organization.new

      if request.post?
        @org = Organization.create(:address => params[:address], :city => params[:city],
          :prov_st => params[:prov_st], :country => params[:country], :email => params[:email],
          :user => User.find(session[:user_id]))